app/views/posts/search.html.erb

			<div id="post-body" style="font-weight: 700;color: rgb(26, 26, 75);"><%= r.text %></div>
			<div id="footer" style="height:15px; width:100%;">Tags:<% r.tags.each do |t| %> <%=link_to t.name, "#", :class=> "tag" %> <% end %><img src="http://jeffcodemocrats.com/wp-content/uploads/2012/10/endorse-checkmark-240x237.jpg" style="width:20px;height:20px;float:right;"/></div>
---
SELECT `tags`.* FROM `tags` INNER JOIN `posts_tags` ON `tags`.`id` = `posts_tags`.`tag_id` WHERE `posts_tags`.`post_id` = 21