app/controllers/home_controller.rb

SELECT `categories`.* FROM `categories`
---
  def index
    @categories = Category.all

SELECT `categories`.* FROM `categories` WHERE `categories`.`name` = 'Products' LIMIT 1
SELECT `items`.* FROM `items` WHERE `items`.`name` = 'Products'
SELECT `subcategories`.* FROM `subcategories` WHERE `subcategories`.`name` = 'Nebulizer' LIMIT 1
---
  def getitems
    @items = Subcategory.find_by_name(params[:subcat]).items

SELECT `categories`.* FROM `categories` WHERE `categories`.`name` = 'Equipment/Devices' LIMIT 1
SELECT `subcategories`.* FROM `subcategories` WHERE `subcategories`.`name` = 'Equipment/Devices' LIMIT 1
---
  def getsubcats
    @subcats = Category.find_by_name(params[:cat]).subcategories

INSERT INTO `posts` (`created_at`, `posted_at`, `text`, `thread_id`, `updated_at`, `username`) VALUES ('2013-10-05 23:39:05', '2013-10-05 23:39:05', ' I didnt know that my girlfriend had Cystic Fibrosis for several weeks, just until recently. Since I had been spending more time with her and being around her more and more, and making my continual interest in her very apparent, she thought I needed to know despite the risk of losing me (she thought I might not want to deal with it). When she told me that she was diagnosed as an infant and about the disease I told her I still wanted to continue our relationship and that I was glad she told me. After all, I was falling in love with her. She was so happy then. The joy in her big eyes was definitely there. You would never once think to look at her that she has this internal war waging on her body.', 15549, '2013-10-05 23:39:05', NULL)
---
  def import
    file = params[:file].read
    CSV.parse(file) do |row|
      row3 = row[3].gsub("'","")
      row3 = row3.gsub("/","")
      uname = (0...8).map { (65 + rand(26)).chr }.join
      Post.create!(thread_id: row[0], text: row3, posted_at: Time.now, username: uname)