app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT `items`.* FROM `items`

  def show
    @item = Item.find(params[:id])
---
SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1

  def edit
    @item = Item.find(params[:id])
---
SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1

  def create
    @item = Item.new(params[:product])

    respond_to do |format|
      if @item.save
---
INSERT INTO `items` (`created_at`, `description`, `name`, `rating`, `subcategory_id`, `updated_at`) VALUES ('2013-10-06 03:36:13', NULL, NULL, NULL, NULL, '2013-10-06 03:36:13')

  def update
    @item = Item.find(params[:id])

    respond_to do |format|
      if @item.update_attributes(params[:product])
---
SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
UPDATE `items` SET `name` = 'Nebulizer 3', `description` = '', `rating` = 3, `subcategory_id` = 1, `updated_at` = '2013-10-06 03:38:37' WHERE `items`.`id` = 8