app/controllers/posts_controller.rb

  def search
    sterm = params[:item]
    if params[:type]
      if params[:type] == "tag"
        tags = params[:item]
        @res = Tag.find_by_name(tags).posts rescue nil
      end
    else
      if sterm != nil
        @res = Item.find_by_name(sterm).posts rescue nil
---
SELECT `tags`.* FROM `tags` WHERE `tags`.`name` = 'breathing' LIMIT 1
SELECT `items`.* FROM `items` WHERE `items`.`name` = 'Product1' LIMIT 1